api-definitions/openapi/examples/ReqActivatePayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <nod:activatePaymentNoticeReq>
         <idPSP>70000000001</idPSP>
         <idBrokerPSP>70000000001</idBrokerPSP>
         <idChannel>70000000001_01</idChannel>
         <password>**********</password>
         <idempotencyKey>70000000001_100149bdWB</idempotencyKey>
         <qrCode>
            <fiscalCode>77777777777</fiscalCode>
            <noticeNumber>311018921337126000</noticeNumber>
         </qrCode>
         <expirationTime>6000</expirationTime>
         <amount>10.00</amount>
      </nod:activatePaymentNoticeReq>
   </soapenv:Body>
</soapenv:Envelope>